<?xml version="1.0"?>
<net name="Model0" version="11">
	<layers>
		<layer id="0" name="x" type="Parameter" version="opset1">
			<data shape="1,3,320,320" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="x">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="__module.model.22/aten::unsqueeze/Unsqueeze" type="Const" version="opset1">
			<data element_type="f32" shape="1, 2, 2100" offset="0" size="16800" />
			<output>
				<port id="0" precision="FP32" names="2336,anchor_points">
					<dim>1</dim>
					<dim>2</dim>
					<dim>2100</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="self.model.0.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="16, 3, 3, 3" offset="16800" size="1728" />
			<output>
				<port id="0" precision="FP32" names="self.model.0.conv.weight">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="__module.model.0.conv/aten::_convolution/Convolution" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="__module.model.0.conv/aten::_convolution/Reshape" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="18528" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="__module.model.0.conv/aten::_convolution/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="97_1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="__module.model.22.cv3.2.1.act/aten::relu_/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="97,input.1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="self.model.1.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="32, 16, 3, 3" offset="18592" size="18432" />
			<output>
				<port id="0" precision="FP32" names="self.model.1.conv.weight">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="__module.model.1.conv/aten::_convolution/Convolution" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="__module.model.1.conv/aten::_convolution/Reshape" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="37024" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="__module.model.1.conv/aten::_convolution/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="111_1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="__module.model.22.cv3.2.1.act/aten::relu_/Relu_1" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="111,input.5">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="self.model.2.cv1.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="32, 32, 1, 1" offset="37152" size="4096" />
			<output>
				<port id="0" precision="FP32" names="self.model.2.cv1.conv.weight">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="__module.model.2.cv1.conv/aten::_convolution/Convolution" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="__module.model.2.cv1.conv/aten::_convolution/Reshape" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="41248" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="__module.model.2.cv1.conv/aten::_convolution/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="129_1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="__module.model.22.cv3.2.1.act/aten::relu_/Relu_2" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="129,input.9">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="117" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="41376" size="8" />
			<output>
				<port id="0" precision="I64" names="117" />
			</output>
		</layer>
		<layer id="18" name="__module.model.2/prim::ListUnpack/ShapeOf" type="ShapeOf" version="opset3">
			<data output_type="i32" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Constant_12160" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="41384" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="__module.model.2/prim::ListUnpack/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I32" />
			</output>
		</layer>
		<layer id="21" name="__module.model.2/prim::ListUnpack/Convert" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="41388" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="22" name="__module.model.2/prim::ListUnpack/Divide" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32" />
			</output>
		</layer>
		<layer id="23" name="__module.model.2/prim::ListUnpack/Mod" type="Mod" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32" />
			</output>
		</layer>
		<layer id="24" name="__module.model.2/prim::ListUnpack/Greater" type="Greater" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="__module.model.2/prim::ListUnpack/Convert_0" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="BOOL">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="__module.model.2/prim::ListUnpack/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Constant_12161" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="41392" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="__module.model.2/prim::ListUnpack/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="__module.model.2/prim::ListUnpack/VariadicSplit" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="132">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="4" precision="FP32" names="133,input.11">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="self.model.2.cv2.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="16, 16, 3, 3" offset="41396" size="9216" />
			<output>
				<port id="0" precision="FP32" names="self.model.2.cv2.conv.weight">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="__module.model.2.cv2.conv/aten::_convolution/Convolution" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="__module.model.2.cv2.conv/aten::_convolution/Reshape" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="50612" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="__module.model.2.cv2.conv/aten::_convolution/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="141_1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="__module.model.22.cv3.2.1.act/aten::relu_/Relu_3" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="141,input.13">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="self.model.2.cv3.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="16, 16, 3, 3" offset="50676" size="9216" />
			<output>
				<port id="0" precision="FP32" names="self.model.2.cv3.conv.weight">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="__module.model.2.cv3.conv/aten::_convolution/Convolution" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="__module.model.2.cv3.conv/aten::_convolution/Reshape" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="59892" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="__module.model.2.cv3.conv/aten::_convolution/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="150_1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="__module.model.22.cv3.2.1.act/aten::relu_/Relu_4" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="150,input.17">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="__module.model.2/aten::cat/Concat" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="153,input.19">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="self.model.2.cv4.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="32, 64, 1, 1" offset="59956" size="8192" />
			<output>
				<port id="0" precision="FP32" names="self.model.2.cv4.conv.weight">
					<dim>32</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="__module.model.2.cv4.conv/aten::_convolution/Convolution" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="__module.model.2.cv4.conv/aten::_convolution/Reshape" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="68148" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="__module.model.2.cv4.conv/aten::_convolution/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="161_1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="__module.model.22.cv3.2.1.act/aten::relu_/Relu_5" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="161,input.21">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="__module.model.3/aten::avg_pool2d/AvgPool" type="AvgPool" version="opset14">
			<data kernel="2, 2" strides="1, 1" pads_begin="0, 0" pads_end="0, 0" exclude-pad="false" auto_pad="explicit" rounding_type="floor" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="173,input.23">
					<dim>1</dim>
					<dim>32</dim>
					<dim>79</dim>
					<dim>79</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="self.model.3.cv1.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="64, 32, 3, 3" offset="68276" size="73728" />
			<output>
				<port id="0" precision="FP32" names="self.model.3.cv1.conv.weight">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="__module.model.3.cv1.conv/aten::_convolution/Convolution" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>79</dim>
					<dim>79</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="__module.model.3.cv1.conv/aten::_convolution/Reshape" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="142004" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="__module.model.3.cv1.conv/aten::_convolution/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="181_1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="__module.model.22.cv3.2.1.act/aten::relu_/Relu_6" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="181,input.25">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="self.model.4.cv1.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="64, 64, 1, 1" offset="142260" size="16384" />
			<output>
				<port id="0" precision="FP32" names="self.model.4.cv1.conv.weight">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="__module.model.4.cv1.conv/aten::_convolution/Convolution" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="__module.model.4.cv1.conv/aten::_convolution/Reshape" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="158644" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="__module.model.4.cv1.conv/aten::_convolution/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="199_1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="__module.model.22.cv3.2.1.act/aten::relu_/Relu_7" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="199,input.29">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="187" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="41376" size="8" />
			<output>
				<port id="0" precision="I64" names="187" />
			</output>
		</layer>
		<layer id="58" name="__module.model.4/prim::ListUnpack/ShapeOf" type="ShapeOf" version="opset3">
			<data output_type="i32" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Constant_12232" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="41384" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="__module.model.4/prim::ListUnpack/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I32" />
			</output>
		</layer>
		<layer id="61" name="__module.model.4/prim::ListUnpack/Convert" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="41388" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="62" name="__module.model.4/prim::ListUnpack/Divide" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32" />
			</output>
		</layer>
		<layer id="63" name="__module.model.4/prim::ListUnpack/Mod" type="Mod" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32" />
			</output>
		</layer>
		<layer id="64" name="__module.model.4/prim::ListUnpack/Greater" type="Greater" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="__module.model.4/prim::ListUnpack/Convert_0" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="BOOL">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="__module.model.4/prim::ListUnpack/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Constant_12233" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="41392" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="__module.model.4/prim::ListUnpack/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="__module.model.4/prim::ListUnpack/VariadicSplit" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="202">
					<dim>1</dim>
					<dim>32</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="4" precision="FP32" names="203,input.31">
					<dim>1</dim>
					<dim>32</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="self.model.4.cv2.0.cv1.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="16, 32, 1, 1" offset="158900" size="2048" />
			<output>
				<port id="0" precision="FP32" names="self.model.4.cv2.0.cv1.conv.weight">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="__module.model.4.cv2.0.cv1.conv/aten::_convolution/Convolution" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="__module.model.4.cv2.0.cv1.conv/aten::_convolution/Reshape" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="160948" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="__module.model.4.cv2.0.cv1.conv/aten::_convolution/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="217_1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="__module.model.22.cv3.2.1.act/aten::relu_/Relu_8" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="217,input.33">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="self.model.4.cv2.0.m.0.cv1.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="16, 16, 3, 3" offset="161012" size="9216" />
			<output>
				<port id="0" precision="FP32" names="self.model.4.cv2.0.m.0.cv1.conv.weight">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="__module.model.4.cv2.0.m.0.cv1.conv/aten::_convolution/Convolution" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="__module.model.4.cv2.0.m.0.cv1.conv/aten::_convolution/Reshape" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="170228" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="__module.model.4.cv2.0.m.0.cv1.conv/aten::_convolution/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="231_1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="__module.model.21.cv3.0.m.2.cv1.act/aten::relu_/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="231,input.37">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="self.model.4.cv2.0.m.0.cv2.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="16, 16, 3, 3" offset="170292" size="9216" />
			<output>
				<port id="0" precision="FP32" names="self.model.4.cv2.0.m.0.cv2.conv.weight">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="__module.model.4.cv2.0.m.0.cv2.conv/aten::_convolution/Convolution" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="__module.model.4.cv2.0.m.0.cv2.conv/aten::_convolution/Reshape" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="179508" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="__module.model.4.cv2.0.m.0.cv2.conv/aten::_convolution/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="240_1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="__module.model.22.cv3.2.1.act/aten::relu_/Relu_9" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="240,input.41">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="__module.model.4.cv2.0.m.0/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="242,input.43">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="self.model.4.cv2.0.m.1.cv1.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="16, 16, 3, 3" offset="179572" size="9216" />
			<output>
				<port id="0" precision="FP32" names="self.model.4.cv2.0.m.1.cv1.conv.weight">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="__module.model.4.cv2.0.m.1.cv1.conv/aten::_convolution/Convolution" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="__module.model.4.cv2.0.m.1.cv1.conv/aten::_convolution/Reshape" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="188788" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="__module.model.4.cv2.0.m.1.cv1.conv/aten::_convolution/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="252_1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="__module.model.21.cv3.0.m.2.cv1.act/aten::relu_/Relu_1" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="252,input.45">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="self.model.4.cv2.0.m.1.cv2.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="16, 16, 3, 3" offset="188852" size="9216" />
			<output>
				<port id="0" precision="FP32" names="self.model.4.cv2.0.m.1.cv2.conv.weight">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="__module.model.4.cv2.0.m.1.cv2.conv/aten::_convolution/Convolution" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="__module.model.4.cv2.0.m.1.cv2.conv/aten::_convolution/Reshape" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="198068" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="__module.model.4.cv2.0.m.1.cv2.conv/aten::_convolution/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="261_1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="__module.model.22.cv3.2.1.act/aten::relu_/Relu_10" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="261,input.49">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="__module.model.4.cv2.0.m.1/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="263,input.51">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="self.model.4.cv2.0.m.2.cv1.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="16, 16, 3, 3" offset="198132" size="9216" />
			<output>
				<port id="0" precision="FP32" names="self.model.4.cv2.0.m.2.cv1.conv.weight">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="__module.model.4.cv2.0.m.2.cv1.conv/aten::_convolution/Convolution" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="__module.model.4.cv2.0.m.2.cv1.conv/aten::_convolution/Reshape" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="207348" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="__module.model.4.cv2.0.m.2.cv1.conv/aten::_convolution/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="273_1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="__module.model.21.cv3.0.m.2.cv1.act/aten::relu_/Relu_2" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="273,input.53">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="self.model.4.cv2.0.m.2.cv2.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="16, 16, 3, 3" offset="207412" size="9216" />
			<output>
				<port id="0" precision="FP32" names="self.model.4.cv2.0.m.2.cv2.conv.weight">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="__module.model.4.cv2.0.m.2.cv2.conv/aten::_convolution/Convolution" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="__module.model.4.cv2.0.m.2.cv2.conv/aten::_convolution/Reshape" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="216628" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="__module.model.4.cv2.0.m.2.cv2.conv/aten::_convolution/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="282_1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="__module.model.22.cv3.2.1.act/aten::relu_/Relu_11" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="282,input.57">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="__module.model.4.cv2.0.m.2/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="284">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="self.model.4.cv2.0.cv2.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="16, 32, 1, 1" offset="216692" size="2048" />
			<output>
				<port id="0" precision="FP32" names="self.model.4.cv2.0.cv2.conv.weight">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="__module.model.4.cv2.0.cv2.conv/aten::_convolution/Convolution" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="__module.model.4.cv2.0.cv2.conv/aten::_convolution/Reshape" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="218740" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="__module.model.4.cv2.0.cv2.conv/aten::_convolution/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="292_1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="__module.model.22.cv3.2.1.act/aten::relu_/Relu_12" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
